<script lang="ts">
  let { width } = $props();
</script>

<svg {width} viewBox="0 0 266.294 135.642">
  <title>Metro Málaga</title>
  <path
    d="m392.863 370.97-.216-134.5h-40.392l-38.398 97.241-.499-97.241h-27.926l-30.419 81.284-1.496-81.284-20.944.498-37.4 96.245-.5-96.245-14.96-.498-52.36 133.644 6.267.142 46.094-112.842V370.83l13.962.141 38.897-97.1.997 96.959 20.446.141 30.419-80.643 1.496 80.785 40.393.074 38.896-97.814.499 97.74z"
    transform="translate(-126.853 -235.97)"
  />
</svg>

<style>
  svg {
    display: inline-block;
    fill: light-dark(#e23527, currentColor);
  }
</style>
